IDEA Open Model
ReinfBarByPolyline.BarDistance Property
Compatible with IDEA StatiCa Beta 20.0
 Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public Vector3D BarDistance { get; set; }
Public Property BarDistance As Vector3D
	Get
	Set
Property Value
Type: Vector3D
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace